doc/prethesis-presentation.org
#+TITLE: Formalization and Verification with Lean
#+AUTHOR: H. Ronald
#+DATE: Nov 28, 2025
#+HTML_HEAD: <link rel="stylesheet" href="reveal-style.css" />
#+OPTIONS: toc:1
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js

* Introduction
** Lean
+ Functional programming language
+ Theorem prover
+ Based on Calculus of inductive constructions (CIC)
  + Inductive types + calculus of constructions (CoC)
+ Calculus of constructions
  + Higher-order typed lambda calculus
  + Curry-Howard
+ Propositions are types, proofs are terms (programs)
  + Proving = type checking
+ Lean uses CIC + universe polymorphism

** Type theory of Lean
+ Dependent type theory
+ Types can depend on values

#+BEGIN_SRC lean4
def divide (x y : Nat) (h : y ≠ 0) : Nat := x / y
#+END_SRC

+ Types can be indexed by runtime values

#+BEGIN_SRC lean4
def head {α : Type} {n : Nat} : Vector α (n + 1) → α
| ⟨data, h⟩ => data[0]
#+END_SRC

#+REVEAL: split
A dependent type theoretic implementation of the function

~head~: [α] → α

#+BEGIN_SRC lean4
inductive NonEmptyList (α : Type) where
| mk : (xs : List α) → xs ≠ [] → NonEmptyList α

def NonEmptyList.head {α} : NonEmptyList α → α
| .mk (x :: _) _ => x
| .mk [] h => (h rfl).elim
#+END_SRC

+ Type of the function already guarantees correctness
+ Impossible cases are removed by logical reasoning
+ No runtime errors

* Theorem Proving
+ p \to q is a proposition
  + but also a function that takes a term of type p as input and outputs a term of type q
+ Two ways
  + Construct lambda terms of the required type
  + Tactic mode
** Tactics
+ Two important tactics are ~intro~ and ~apply~
+ ~intro~ (assume, declaration)
  + introduces or brings assumptions in local context
  + want to prove p → q → r
  + bring proofs of ~p~ and ~q~ in the local context
+ ~apply~ (function application)
  + want to prove ~r : Prop~
  + suppose we have the function (constructor) x : a → r
  + ~apply x~ would reduce the goal to proving ~a~

#+REVEAL: split
+ Local context
+ Goal (or goals or subgoals)
  + Applying f : p → q → r → s to the goal s will gives us three subgoals p, q and r

#+BEGIN_SRC lean4
example (P Q : Nat → Prop) : (∃ x, P x ∧ Q x) → ∃ x, Q x ∧ P x := by
  intro h
  cases h with
  | intro k hpq =>
    cases hpq with
    | intro hp hq => constructor ; apply And.intro ; exact hq ; exact hp
#+END_SRC

+ A brief demo of tactic mode

** Lambda terms as proofs
+ To prove p → q, we write a lambda term of that type
+ Can switch between tactic mode and term mode
+ An example below (resolution rule)

#+BEGIN_SRC lean4
example : (p ∨ A) ∧ (¬p ∨ B) → A ∨ B :=
  fun ⟨ha, hb⟩ =>
  match ha with
  | Or.inl hp =>
    match hb with
    | Or.inl hnp => absurd hp hnp
    | Or.inr h   => Or.inr h
  | Or.inr h  => Or.inl h
#+END_SRC

#+REVEAL: split
Lean also provides tools for working with Classical logic

+ For any proposition ~p~, ~Classical.em p~ gives a term of type ~p ∨ ¬p~.

#+BEGIN_SRC lean4
example : ¬(p ∧ ¬q) → (p → q) :=
  fun h : ¬(p ∧ ¬q) =>
  fun hp =>
  Or.elim (Classical.em q)
  (fun hq  :  q => hq)
  (fun hnq : ¬q => absurd ⟨hp, hnq⟩ h)
#+END_SRC

+ ~if else~ and Pierce's law
Using if else automatically activates Classical.em

#+BEGIN_SRC lean4
example : ((p → q) → p) → p :=
  fun h =>
  if hp : p then hp
  else let hpq : p → q := fun hp' => absurd hp' hp
  h hpq
#+END_SRC

* Functional Programming
