doc/prethesis-presentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Formalization and Verification with Lean</title>
<meta name="author" content="H. Ronald"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<link rel="stylesheet" href="reveal-style.css" />
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Formalization and Verification with Lean</h1><p class="subtitle"></p>
<h2 class="author">H. Ronald</h2><h2 class="date">Nov 28, 2025</h2><p class="date">Created: 2025-11-28 Fri 19:34</p>
</section>
<section id="sec-table-of-contents"><div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#/slide-org7f285aa">1. Introduction</a></li>
<li><a href="#/slide-orgd6d365b">2. Theorem Proving</a></li>
<li><a href="#/slide-orgc3d3779">3. Functional Programming</a></li>
<li><a href="#/slide-org2687531">4. Automation</a></li>
<li><a href="#/slide-org3c7c645">5. Verification</a></li>
</ul>
</div>
</div>
</section>
<section>
<section id="slide-org7f285aa">
<h2 id="org7f285aa"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-org49f32b8">
<h3 id="org49f32b8"><span class="section-number-3">1.1.</span> Lean</h3>
<ul>
<li>Functional programming language</li>
<li>Theorem prover</li>
<li>Based on Calculus of inductive constructions (CIC)
<ul>
<li>Inductive types + calculus of constructions (CoC)</li>

</ul></li>
<li>Calculus of constructions
<ul>
<li>Higher-order typed lambda calculus</li>
<li>Curry-Howard</li>

</ul></li>
<li>Propositions are types, proofs are terms (programs)
<ul>
<li>Proving = type checking</li>

</ul></li>
<li>Lean uses CIC + universe polymorphism</li>

</ul>
</section>
<section id="slide-orgf849d7b">
<h3 id="orgf849d7b"><span class="section-number-3">1.2.</span> Type theory of Lean</h3>
<ul>
<li>Dependent type theory</li>
<li>Types can depend on values</li>

</ul>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>def divide (x y : Nat) (h : y ≠ 0) : Nat := x / y
</code></pre>
</div>

<ul>
<li>Types can be indexed by runtime values</li>

</ul>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>def head {α : Type} {n : Nat} : Vector α (n + 1) → α
| ⟨data, h⟩ =&gt; data[0]
</code></pre>
</div>

</section>
<section id="slide-orgf849d7b-split">
<p>
A dependent type theoretic implementation of the function
</p>

<p>
<code>head</code>: [α] → α
</p>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>inductive NonEmptyList (α : Type) where
| mk : (xs : List α) → xs ≠ [] → NonEmptyList α

def NonEmptyList.head {α} : NonEmptyList α → α
| .mk (x :: _) _ =&gt; x
| .mk [] h =&gt; (h rfl).elim
</code></pre>
</div>

<ul>
<li>Type of the function already guarantees correctness</li>
<li>Impossible cases are removed by logical reasoning</li>
<li>No runtime errors</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd6d365b">
<h2 id="orgd6d365b"><span class="section-number-2">2.</span> Theorem Proving</h2>
<ul>
<li>p &rarr; q is a proposition
<ul>
<li>but also a function that takes a term of type p as input and outputs a term of type q</li>

</ul></li>
<li>Two ways
<ul>
<li>Construct lambda terms of the required type</li>
<li>Tactic mode</li>

</ul></li>

</ul>
</section>
<section id="slide-org587bfc8">
<h3 id="org587bfc8"><span class="section-number-3">2.1.</span> Tactics</h3>
<ul>
<li>Two important tactics are <code>intro</code> and <code>apply</code></li>
<li><code>intro</code> (assume, declaration)
<ul>
<li>introduces or brings assumptions in local context</li>
<li>want to prove p → q → r</li>
<li>bring proofs of <code>p</code> and <code>q</code> in the local context</li>

</ul></li>
<li><code>apply</code> (function application)
<ul>
<li>want to prove <code>r : Prop</code></li>
<li>suppose we have the function (constructor) x : a → r</li>
<li><code>apply x</code> would reduce the goal to proving <code>a</code></li>

</ul></li>

</ul>

</section>
<section id="slide-org587bfc8-split">
<ul>
<li>Local context</li>
<li>Goal (or goals or subgoals)
<ul>
<li>Applying f : p → q → r → s to the goal s will gives us three subgoals p, q and r</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>example (P Q : Nat → Prop) : (∃ x, P x ∧ Q x) → ∃ x, Q x ∧ P x := by
  intro h
  cases h with
  | intro k hpq =&gt;
    cases hpq with
    | intro hp hq =&gt; constructor ; apply And.intro ; exact hq ; exact hp
</code></pre>
</div>

<ul>
<li>A brief demo of tactic mode</li>

</ul>
</section>
<section id="slide-orgc32587c">
<h3 id="orgc32587c"><span class="section-number-3">2.2.</span> Lambda terms as proofs</h3>
<ul>
<li>To prove p → q, we write a lambda term of that type</li>
<li>Can switch between tactic mode and term mode</li>
<li>An example below (resolution rule)</li>

</ul>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>example : (p ∨ A) ∧ (¬p ∨ B) → A ∨ B :=
  fun ⟨ha, hb⟩ =&gt;
  match ha with
  | Or.inl hp =&gt;
    match hb with
    | Or.inl hnp =&gt; absurd hp hnp
    | Or.inr h   =&gt; Or.inr h
  | Or.inr h  =&gt; Or.inl h
</code></pre>
</div>

</section>
<section id="slide-orgc32587c-split">
<p>
Lean also provides tools for working with Classical logic
</p>

<ul>
<li>For any proposition <code>p</code>, <code>Classical.em p</code> gives a term of type <code>p ∨ ¬p</code>.</li>

</ul>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>example : ¬(p ∧ ¬q) → (p → q) :=
  fun h : ¬(p ∧ ¬q) =&gt;
  fun hp =&gt;
  Or.elim (Classical.em q)
  (fun hq  :  q =&gt; hq)
  (fun hnq : ¬q =&gt; absurd ⟨hp, hnq⟩ h)
</code></pre>
</div>

<ul>
<li><code>if else</code> and Pierce's law</li>

</ul>
<p>
Using if else automatically activates Classical.em
</p>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>example : ((p → q) → p) → p :=
  fun h =&gt;
  if hp : p then hp
  else let hpq : p → q := fun hp' =&gt; absurd hp' hp
  h hpq
</code></pre>
</div>
</section>
</section>
