doc/prethesis-presentation.tex
% Created 2025-11-28 Fri 19:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{H. Ronald}
\date{Nov 28, 2025}
\title{Formalization and Verification with Lean}
\hypersetup{
 pdfauthor={H. Ronald},
 pdftitle={Formalization and Verification with Lean},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{1}
\tableofcontents

\section{Introduction}
\label{sec:org333bd00}
\subsection{Lean}
\label{sec:org8964a0c}
\begin{itemize}
\item Functional programming language
\item Theorem prover
\item Based on Calculus of inductive constructions (CIC)
\begin{itemize}
\item Inductive types + calculus of constructions (CoC)
\end{itemize}
\item Calculus of constructions
\begin{itemize}
\item Higher-order typed lambda calculus
\item Curry-Howard
\end{itemize}
\item Propositions are types, proofs are terms (programs)
\begin{itemize}
\item Proving = type checking
\end{itemize}
\item Lean uses CIC + universe polymorphism
\end{itemize}
\subsection{Type theory of Lean}
\label{sec:org418f02a}
\begin{itemize}
\item Dependent type theory
\item Types can depend on values
\end{itemize}

\begin{verbatim}
def divide (x y : Nat) (h : y ≠ 0) : Nat := x / y
\end{verbatim}

\begin{itemize}
\item Types can be indexed by runtime values
\end{itemize}

\begin{verbatim}
def head {α : Type} {n : Nat} : Vector α (n + 1) → α
| ⟨data, h⟩ => data[0]
\end{verbatim}

A dependent type theoretic implementation of the function

\texttt{head}: [α] → α

\begin{verbatim}
inductive NonEmptyList (α : Type) where
| mk : (xs : List α) → xs ≠ [] → NonEmptyList α

def NonEmptyList.head {α} : NonEmptyList α → α
| .mk (x :: _) _ => x
| .mk [] h => (h rfl).elim
\end{verbatim}

\begin{itemize}
\item Type of the function already guarantees correctness
\item Impossible cases are removed by logical reasoning
\item No runtime errors
\end{itemize}
\section{Theorem Proving}
\label{sec:org22f0d21}
\begin{itemize}
\item p \(\to\) q is a proposition
\begin{itemize}
\item but also a function that takes a term of type p as input and outputs a term of type q
\end{itemize}
\item Two ways
\begin{itemize}
\item Construct lambda terms of the required type
\item Tactic mode
\end{itemize}
\end{itemize}
\subsection{Tactics}
\label{sec:org1b6fb90}
\begin{itemize}
\item Two important tactics are \texttt{intro} and \texttt{apply}
\item \texttt{intro} (assume, declaration)
\begin{itemize}
\item introduces or brings assumptions in local context
\item want to prove p → q → r
\item bring proofs of \texttt{p} and \texttt{q} in the local context
\end{itemize}
\item \texttt{apply} (function application)
\begin{itemize}
\item want to prove \texttt{r : Prop}
\item suppose we have the function (constructor) x : a → r
\item \texttt{apply x} would reduce the goal to proving \texttt{a}
\end{itemize}
\end{itemize}

\begin{itemize}
\item Local context
\item Goal (or goals or subgoals)
\begin{itemize}
\item Applying f : p → q → r → s to the goal s will gives us three subgoals p, q and r
\end{itemize}
\end{itemize}

\begin{verbatim}
example (P Q : Nat → Prop) : (∃ x, P x ∧ Q x) → ∃ x, Q x ∧ P x := by
  intro h
  cases h with
  | intro k hpq =>
    cases hpq with
    | intro hp hq => constructor ; apply And.intro ; exact hq ; exact hp
\end{verbatim}

\begin{itemize}
\item A brief demo of tactic mode
\end{itemize}
\subsection{Lambda terms as proofs}
\label{sec:org8a453a3}
\begin{itemize}
\item To prove p → q, we write a lambda term of that type
\item Can switch between tactic mode and term mode
\item An example below (resolution rule)
\end{itemize}

\begin{verbatim}
example : (p ∨ A) ∧ (¬p ∨ B) → A ∨ B :=
  fun ⟨ha, hb⟩ =>
  match ha with
  | Or.inl hp =>
    match hb with
    | Or.inl hnp => absurd hp hnp
    | Or.inr h   => Or.inr h
  | Or.inr h  => Or.inl h
\end{verbatim}

Lean also provides tools for working with Classical logic

\begin{itemize}
\item For any proposition \texttt{p}, \texttt{Classical.em p} gives a term of type \texttt{p ∨ ¬p}.
\end{itemize}

\begin{verbatim}
example : ¬(p ∧ ¬q) → (p → q) :=
  fun h : ¬(p ∧ ¬q) =>
  fun hp =>
  Or.elim (Classical.em q)
  (fun hq  :  q => hq)
  (fun hnq : ¬q => absurd ⟨hp, hnq⟩ h)
\end{verbatim}

\begin{itemize}
\item \texttt{if else} and Pierce's law
\end{itemize}
Using if else automatically activates Classical.em

\begin{verbatim}
example : ((p → q) → p) → p :=
  fun h =>
  if hp : p then hp
  else let hpq : p → q := fun hp' => absurd hp' hp
  h hpq
\end{verbatim}
