doc/prethesis-presentation.org
** Inductive types
#+BEGIN_SRC lean4
inductive Even : Nat → Prop
| zero : Even 0
| next : ∀ n : Nat, Even n → Even (n + 2)
#+END_SRC

Inductive types for logical connectives

#+BEGIN_SRC lean4
inductive And' (p q : Prop) : Prop
| intro : p → q → And' p q
#+END_SRC

#+BEGIN_SRC lean4
inductive Or' : Prop → Prop → Prop
| inl : p → Or' p q
| inr : q → Or' p q
#+END_SRC

#+REVEAL: split
Inductive definition gives constructors and destructors

+ Use constructors as introduction rules
+ Use case analysis on constructors (cases/induction) as elimination rules

The following are elimination rules for And.

#+BEGIN_SRC lean4
theorem And'.left : And' p q → p := by
  intro hpq
  cases hpq with
  | intro => assumption                    -- use of unnamed hypotheses

theorem And'.right : And' p q → q := by
  intro hpq
  cases hpq with
  | intro => assumption
#+END_SRC

#+REVEAL: split
A simple example (p ∧ q → q ∧ p):

#+BEGIN_SRC lean4
example (p q : Prop) : And' p q → And' q p := by
  intro hpq
  have hp : p := And'.left  hpq
  have hq : q := And'.right hpq
  exact And'.intro hq hp
#+END_SRC

#+REVEAL: split
Likewise, for existential statements and XOR operations.

#+BEGIN_SRC lean4
inductive Exists' {α : Type} (P : α → Prop) : Prop
| intro : (a : α) → P a → Exists' P

inductive Xor' : Prop → Prop → Prop
| inl : p → ¬q → Xor' p q
| inr : ¬p → q → Xor' p q
#+END_SRC

** Monads
+ Type constructor (Type → Type)
+ Two functions
  + pure (return, unit)
  + bind (join, multiplication)
+ Obeys three laws
  + Two identity laws
  + Associativity

#+BEGIN_SRC lean4
class Monad' (m : Type → Type) where
pure : α → m α
bind : m α → (α → m β) → m β

class LawfulMonad' (m : Type → Type) extends Monad' m where
pure_bind (a : α) (f : α → m β) :
  bind (pure a) f = f a
bind_pure (ma : m α) :
  bind ma (pure) = ma
bind_assoc (f : α → m β) (g : β → m γ) (ma : m α) :
  bind (bind ma f) g = bind ma (fun a => bind (f a) g)
#+END_SRC

#+REVEAL: split
Why monads?

+ Write pure functional programs in imperative style
+ All tactics proofs are just monadic operations
  + Tactic execution, logging, metavariable manipulation, backtracking, etc. are effectful
  + Tactics must fail cleanly (~throwError~), try alternatives (~try~, ~first~), brach, backtrack automatically
+ Metaprogramming (we will see soon enough)
+ Verification (we will see soon enough)

** Anatomy of a tactic proof
+ ~MetaM~, ~TacticM~ monads
+ Every tactic execution
  + reads environment (~Env~)
  + mutates goal state
  + may fail
  + may backtrack
  + may log messages
+ Monads allows this composition so smoothly

#+REVEAL: split
+ Every tactic (e.g., ~intro~, ~apply~, ~rw~, ~simp~) is a function\\
   TacticState → TacticM TacticState
  + reads the current state
  + performs an effect (modify goal, intro a binder, etc.)
  + returns the new state
  + or throws an error

* Automation
+ Built-in tactics
  + ~rw~, ~simp~
+ Tactic combinators
  + ~tac_1 <;> tac_2~
  + ~repeat' tac~
  + ~any_goals tac~
  + ~all_goals tac~
+ ~syntax~ and ~macro_rules~
  + Wrap up a procedure (or a programmed bunch of tactics) into one tactic
** Metaprogramming monads
~MetaM~, ~TacticM~ are metaprogramming monads
+ Manipulate goals and local context
+ Iterate over local context
+ Change goal list, close a goal

Using the built-in eliminator for AND:

#+BEGIN_SRC lean4
example (h : a ∧ b ∧ c ∧ d) : d := by apply And.right (And.right (And.right h))
#+END_SRC

With custom tactic ~destruct_and~:

#+BEGIN_SRC lean4
example (h : a ∧ b ∧ c ∧ d) : c := by destruct_and h
#+END_SRC

Another example is ~prove_direct~.

* Verification
+ Monads encode computations (~Option~, ~StateM~, ~TacticM~)
+ A computation or a program can be thought of as a monad (M α)
+ Specification monad (W α) specific to a monad M α
+ Weakest precondition transformer WP_M : M \alpha \to W \alpha
+ W is often chosen to be W α = (α → L) → L
+ Then WP : M α → (α → L) → L
