doc/prethesis-presentation.html
<section>
<section id="slide-orgc3d3779">
<h2 id="orgc3d3779"><span class="section-number-2">3.</span> Functional Programming</h2>
<div class="outline-text-2" id="text-3">
</div>
</section>
<section id="slide-org8e95064">
<h3 id="org8e95064"><span class="section-number-3">3.1.</span> Inductive types</h3>
<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>inductive Even : Nat → Prop
| zero : Even 0
| next : ∀ n : Nat, Even n → Even (n + 2)
</code></pre>
</div>

<p>
Inductive types for logical connectives
</p>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>inductive And' (p q : Prop) : Prop
| intro : p → q → And' p q
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>inductive Or' : Prop → Prop → Prop
| inl : p → Or' p q
| inr : q → Or' p q
</code></pre>
</div>

</section>
<section id="slide-org8e95064-split">
<p>
Inductive definition gives constructors and destructors
</p>

<ul>
<li>Use constructors as introduction rules</li>
<li>Use case analysis on constructors (cases/induction) as elimination rules</li>

</ul>

<p>
The following are elimination rules for And.
</p>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>theorem And'.left : And' p q → p := by
  intro hpq
  cases hpq with
  | intro =&gt; assumption                    -- use of unnamed hypotheses

theorem And'.right : And' p q → q := by
  intro hpq
  cases hpq with
  | intro =&gt; assumption
</code></pre>
</div>

</section>
<section id="slide-org8e95064-split">
<p>
A simple example (p ∧ q → q ∧ p):
</p>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>example (p q : Prop) : And' p q → And' q p := by
  intro hpq
  have hp : p := And'.left  hpq
  have hq : q := And'.right hpq
  exact And'.intro hq hp
</code></pre>
</div>

</section>
<section id="slide-org8e95064-split">
<p>
Likewise, for existential statements and XOR operations.
</p>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>inductive Exists' {α : Type} (P : α → Prop) : Prop
| intro : (a : α) → P a → Exists' P

inductive Xor' : Prop → Prop → Prop
| inl : p → ¬q → Xor' p q
| inr : ¬p → q → Xor' p q
</code></pre>
</div>
</section>
<section id="slide-org95ac00d">
<h3 id="org95ac00d"><span class="section-number-3">3.2.</span> Monads</h3>
<ul>
<li>Type constructor (Type → Type)</li>
<li>Two functions
<ul>
<li>pure (return, unit)</li>
<li>bind (join, multiplication)</li>

</ul></li>
<li>Obeys three laws
<ul>
<li>Two identity laws</li>
<li>Associativity</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>class Monad' (m : Type → Type) where
pure : α → m α
bind : m α → (α → m β) → m β

class LawfulMonad' (m : Type → Type) extends Monad' m where
pure_bind (a : α) (f : α → m β) :
  bind (pure a) f = f a
bind_pure (ma : m α) :
  bind ma (pure) = ma
bind_assoc (f : α → m β) (g : β → m γ) (ma : m α) :
  bind (bind ma f) g = bind ma (fun a =&gt; bind (f a) g)
</code></pre>
</div>

</section>
<section id="slide-org95ac00d-split">
<p>
Why monads?
</p>

<ul>
<li>Write pure functional programs in imperative style</li>
<li>All tactics proofs are just monadic operations
<ul>
<li>Tactic execution, logging, metavariable manipulation, backtracking, etc. are effectful</li>
<li>Tactics must fail cleanly (<code>throwError</code>), try alternatives (<code>try</code>, <code>first</code>), brach, backtrack automatically</li>

</ul></li>
<li>Metaprogramming (we will see soon enough)</li>
<li>Verification (we will see soon enough)</li>

</ul>
</section>
<section id="slide-org8956b07">
<h3 id="org8956b07"><span class="section-number-3">3.3.</span> Anatomy of a tactic proof</h3>
<ul>
<li><code>MetaM</code>, <code>TacticM</code> monads</li>
<li>Every tactic execution
<ul>
<li>reads environment (<code>Env</code>)</li>
<li>mutates goal state</li>
<li>may fail</li>
<li>may backtrack</li>
<li>may log messages</li>

</ul></li>
<li>Monads allows this composition so smoothly</li>

</ul>

</section>
<section id="slide-org8956b07-split">
<ul>
<li>Every tactic (e.g., <code>intro</code>, <code>apply</code>, <code>rw</code>, <code>simp</code>) is a function<br />
TacticState → TacticM TacticState
<ul>
<li>reads the current state</li>
<li>performs an effect (modify goal, intro a binder, etc.)</li>
<li>returns the new state</li>
<li>or throws an error</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-org2687531">
<h2 id="org2687531"><span class="section-number-2">4.</span> Automation</h2>
<ul>
<li>Built-in tactics
<ul>
<li><code>rw</code>, <code>simp</code></li>

</ul></li>
<li>Tactic combinators
<ul>
<li><code>tac_1 &lt;;&gt; tac_2</code></li>
<li><code>repeat' tac</code></li>
<li><code>any_goals tac</code></li>
<li><code>all_goals tac</code></li>

</ul></li>
<li><code>syntax</code> and <code>macro_rules</code>
<ul>
<li>Wrap up a procedure (or a programmed bunch of tactics) into one tactic</li>

</ul></li>

</ul>
</section>
<section id="slide-org5e250da">
<h3 id="org5e250da"><span class="section-number-3">4.1.</span> Metaprogramming monads</h3>
<p>
<code>MetaM</code>, <code>TacticM</code> are metaprogramming monads
</p>
<ul>
<li>Manipulate goals and local context</li>
<li>Iterate over local context</li>
<li>Change goal list, close a goal</li>

</ul>

<p>
Using the built-in eliminator for AND:
</p>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>example (h : a ∧ b ∧ c ∧ d) : d := by apply And.right (And.right (And.right h))
</code></pre>
</div>

<p>
With custom tactic <code>destruct_and</code>:
</p>

<div class="org-src-container">

<pre  class="src src-lean4"   ><code trim>example (h : a ∧ b ∧ c ∧ d) : c := by destruct_and h
</code></pre>
</div>

<p>
Another example is <code>prove_direct</code>.
</p>
</section>
</section>
<section>
<section id="slide-org3c7c645">
<h2 id="org3c7c645"><span class="section-number-2">5.</span> Verification</h2>
<ul>
<li>Monads encode computations (<code>Option</code>, <code>StateM</code>, <code>TacticM</code>)</li>
<li>A computation or a program can be thought of as a monad (M α)</li>
<li>Specification monad (W α) specific to a monad M α</li>
<li>Weakest precondition transformer WP<sub>M</sub> : M &alpha; &rarr; W &alpha;</li>
<li>W is often chosen to be W α = (α → L) → L</li>
<li>Then WP : M α → (α → L) → L</li>

</ul>
</section>
