doc/prethesis-presentation.tex
\section{Functional Programming}
\label{sec:org180e0ca}
\subsection{Inductive types}
\label{sec:org097c3a9}
\begin{verbatim}
inductive Even : Nat → Prop
| zero : Even 0
| next : ∀ n : Nat, Even n → Even (n + 2)
\end{verbatim}

Inductive types for logical connectives

\begin{verbatim}
inductive And' (p q : Prop) : Prop
| intro : p → q → And' p q
\end{verbatim}

\begin{verbatim}
inductive Or' : Prop → Prop → Prop
| inl : p → Or' p q
| inr : q → Or' p q
\end{verbatim}

Inductive definition gives constructors and destructors

\begin{itemize}
\item Use constructors as introduction rules
\item Use case analysis on constructors (cases/induction) as elimination rules
\end{itemize}

The following are elimination rules for And.

\begin{verbatim}
theorem And'.left : And' p q → p := by
  intro hpq
  cases hpq with
  | intro => assumption                    -- use of unnamed hypotheses

theorem And'.right : And' p q → q := by
  intro hpq
  cases hpq with
  | intro => assumption
\end{verbatim}

A simple example (p ∧ q → q ∧ p):

\begin{verbatim}
example (p q : Prop) : And' p q → And' q p := by
  intro hpq
  have hp : p := And'.left  hpq
  have hq : q := And'.right hpq
  exact And'.intro hq hp
\end{verbatim}

Likewise, for existential statements and XOR operations.

\begin{verbatim}
inductive Exists' {α : Type} (P : α → Prop) : Prop
| intro : (a : α) → P a → Exists' P

inductive Xor' : Prop → Prop → Prop
| inl : p → ¬q → Xor' p q
| inr : ¬p → q → Xor' p q
\end{verbatim}
\subsection{Monads}
\label{sec:orgdf8a9d1}
\begin{itemize}
\item Type constructor (Type → Type)
\item Two functions
\begin{itemize}
\item pure (return, unit)
\item bind (join, multiplication)
\end{itemize}
\item Obeys three laws
\begin{itemize}
\item Two identity laws
\item Associativity
\end{itemize}
\end{itemize}

\begin{verbatim}
class Monad' (m : Type → Type) where
pure : α → m α
bind : m α → (α → m β) → m β

class LawfulMonad' (m : Type → Type) extends Monad' m where
pure_bind (a : α) (f : α → m β) :
  bind (pure a) f = f a
bind_pure (ma : m α) :
  bind ma (pure) = ma
bind_assoc (f : α → m β) (g : β → m γ) (ma : m α) :
  bind (bind ma f) g = bind ma (fun a => bind (f a) g)
\end{verbatim}

Why monads?

\begin{itemize}
\item Write pure functional programs in imperative style
\item All tactics proofs are just monadic operations
\begin{itemize}
\item Tactic execution, logging, metavariable manipulation, backtracking, etc. are effectful
\item Tactics must fail cleanly (\texttt{throwError}), try alternatives (\texttt{try}, \texttt{first}), brach, backtrack automatically
\end{itemize}
\item Metaprogramming (we will see soon enough)
\item Verification (we will see soon enough)
\end{itemize}
\subsection{Anatomy of a tactic proof}
\label{sec:orgaafbf96}
\begin{itemize}
\item \texttt{MetaM}, \texttt{TacticM} monads
\item Every tactic execution
\begin{itemize}
\item reads environment (\texttt{Env})
\item mutates goal state
\item may fail
\item may backtrack
\item may log messages
\end{itemize}
\item Monads allows this composition so smoothly
\end{itemize}

\begin{itemize}
\item Every tactic (e.g., \texttt{intro}, \texttt{apply}, \texttt{rw}, \texttt{simp}) is a function\\
TacticState → TacticM TacticState
\begin{itemize}
\item reads the current state
\item performs an effect (modify goal, intro a binder, etc.)
\item returns the new state
\item or throws an error
\end{itemize}
\end{itemize}
\section{Automation}
\label{sec:orgc6525c2}
\begin{itemize}
\item Built-in tactics
\begin{itemize}
\item \texttt{rw}, \texttt{simp}
\end{itemize}
\item Tactic combinators
\begin{itemize}
\item \texttt{tac\_1 <;> tac\_2}
\item \texttt{repeat' tac}
\item \texttt{any\_goals tac}
\item \texttt{all\_goals tac}
\end{itemize}
\item \texttt{syntax} and \texttt{macro\_rules}
\begin{itemize}
\item Wrap up a procedure (or a programmed bunch of tactics) into one tactic
\end{itemize}
\end{itemize}
\subsection{Metaprogramming monads}
\label{sec:org7b9e319}
\texttt{MetaM}, \texttt{TacticM} are metaprogramming monads
\begin{itemize}
\item Manipulate goals and local context
\item Iterate over local context
\item Change goal list, close a goal
\end{itemize}

Using the built-in eliminator for AND:

\begin{verbatim}
example (h : a ∧ b ∧ c ∧ d) : d := by apply And.right (And.right (And.right h))
\end{verbatim}

With custom tactic \texttt{destruct\_and}:

\begin{verbatim}
example (h : a ∧ b ∧ c ∧ d) : c := by destruct_and h
\end{verbatim}

Another example is \texttt{prove\_direct}.
\section{Verification}
\label{sec:orgb4dfd36}
\begin{itemize}
\item Monads encode computations (\texttt{Option}, \texttt{StateM}, \texttt{TacticM})
\item A computation or a program can be thought of as a monad (M α)
\item Specification monad (W α) specific to a monad M α
\item Weakest precondition transformer WP\textsubscript{M} : M \(\alpha\) \(\to\) W \(\alpha\)
\item W is often chosen to be W α = (α → L) → L
\item Then WP : M α → (α → L) → L
\end{itemize}
