doc/prethesis-presentation.org
** Loom
+ A framework for automated generation of foundational multi-modal verifiers
+ The theoretical basis (in their words, "our main theoretical result") lies in transformer monads and transformer monad algebras

#+REVEAL: split
+ M : monad (program)
+ L : assertion language (in which we will write preconditions and postconditions)
  + ~Prop~, σ → Prop
+ μ : M L → L (monad algebra)
  + Given a computation that would return a postcondition, return the precondition that guarantees that postcondition after running that computation
+ Define WP m post = μ (fmap post m)
  + Recall: post : α → L, m : M α, fmap post m : M L
+ Then WP has the type M α → (α → L) → L
+ Then the weakest precondition is given by WP m post

#+REVEAL: split
+ Monad transformer
  + Takes a monad, gives a monad
  + StateT transformer for StateM monad
    + StateT σ M α ≅ σ → M (α × σ)
  + MaybeT M α ≅ M (Option α)
+ Why use monad transformers?
  + Reuse the WP machinery we already have for the underlying monad M, rather then re-prove everything from scratch for StateT σ M
  + Can lift monad algebra/WP through transformers

#+REVEAL: split
+ Monad transformer algebra
  + is a pair (T, F)
  + F (endofunctor) will transform base assertion language L into the assertion language F(L) of T M
    + e.g., for StateT, we have F L = σ → L
+ Lifted monad algebra
  + Fμ : T M (F L) → F L
  + Recall: underlying monad algebra μ : M L → L
+ Fμ gives monad algebra for the transformed monad T M at transformed language F L
+ How do we construct Fμ?
  + Use pattern-match on T and use μ
+ WP tm post = Fμ (fmap post tm)

#+REVEAL: split
How do we implement this for stateful computations?
+ Decide the assertion language, L = σ → Prop
+ Write definition of StateT (involves instantiation of MonadTransformer typeclass)
  + F L = σ → L (we saw this before)
+ Design μ : StateM (σ → Prop) → (σ → Prop) (involves proving laws of monad algebra)
+ Derive Fμ for StateT (algorithmic)
+ Mechanically evaluate WP m post = Fμ (fmap post m)
+ Generate verification conditions (VCs): ~pre1 => wp~ and hand off to an SMT solver
** Case Study: Cashmere
+ ~CashmereM~
  + ~NonDetT (ExceptT String (StateT Bal DivM))~
+ Bank operations
  + Cash withdrawal, deposits, etc.
+ DSL (imperative-style)
+ ~require~, ~ensure~

#+REVEAL: split
Examples of Cashmere programs
+ Withdraw an amount

#+BEGIN_SRC lean4
bdef withdraw (amount : Nat) returns (u: Unit)
  ensures balance + amount = balanceOld do
  balance := balance - amount
  return

prove_correct withdraw by
loom_solve
#+END_SRC

#+REVEAL: split
+ Withdraw session (withdrawing multiple amounts)

#+BEGIN_SRC lean4
open PartialCorrectness DemonicChoice in
bdef withdrawSession (amounts : List Nat) returns (u: Unit)
  ensures balance + amounts.sum = balanceOld do
  let mut tmp := amounts
  let balancePrev := balance
  while tmp.nonEmpty
  invariant balance + amounts.sum = balancePrev + tmp.sum
  do
    let amount := tmp.head!
    balance := balance - amount
    tmp := tmp.tail
  return

open PartialCorrectness DemonicChoice in
prove_correct withdrawSession by
loom_solve!
#+END_SRC
