doc/prethesis-presentation.tex
\subsection{Loom}
\label{sec:org68ad7e3}
\begin{itemize}
\item A framework for automated generation of foundational multi-modal verifiers
\item The theoretical basis (in their words, "our main theoretical result") lies in transformer monads and transformer monad algebras
\end{itemize}

\begin{itemize}
\item M : monad (program)
\item L : assertion language (in which we will write preconditions and postconditions)
\begin{itemize}
\item \texttt{Prop}, σ → Prop
\end{itemize}
\item μ : M L → L (monad algebra)
\begin{itemize}
\item Given a computation that would return a postcondition, return the precondition that guarantees that postcondition after running that computation
\end{itemize}
\item Define WP m post = μ (fmap post m)
\begin{itemize}
\item Recall: post : α → L, m : M α, fmap post m : M L
\end{itemize}
\item Then WP has the type M α → (α → L) → L
\item Then the weakest precondition is given by WP m post
\end{itemize}

\begin{itemize}
\item Monad transformer
\begin{itemize}
\item Takes a monad, gives a monad
\item StateT transformer for StateM monad
\begin{itemize}
\item StateT σ M α ≅ σ → M (α × σ)
\end{itemize}
\item MaybeT M α ≅ M (Option α)
\end{itemize}
\item Why use monad transformers?
\begin{itemize}
\item Reuse the WP machinery we already have for the underlying monad M, rather then re-prove everything from scratch for StateT σ M
\item Can lift monad algebra/WP through transformers
\end{itemize}
\end{itemize}

\begin{itemize}
\item Monad transformer algebra
\begin{itemize}
\item is a pair (T, F)
\item F (endofunctor) will transform base assertion language L into the assertion language F(L) of T M
\begin{itemize}
\item e.g., for StateT, we have F L = σ → L
\end{itemize}
\end{itemize}
\item Lifted monad algebra
\begin{itemize}
\item Fμ : T M (F L) → F L
\item Recall: underlying monad algebra μ : M L → L
\end{itemize}
\item Fμ gives monad algebra for the transformed monad T M at transformed language F L
\item How do we construct Fμ?
\begin{itemize}
\item Use pattern-match on T and use μ
\end{itemize}
\item WP tm post = Fμ (fmap post tm)
\end{itemize}

How do we implement this for stateful computations?
\begin{itemize}
\item Decide the assertion language, L = σ → Prop
\item Write definition of StateT (involves instantiation of MonadTransformer typeclass)
\begin{itemize}
\item F L = σ → L (we saw this before)
\end{itemize}
\item Design μ : StateM (σ → Prop) → (σ → Prop) (involves proving laws of monad algebra)
\item Derive Fμ for StateT (algorithmic)
\item Mechanically evaluate WP m post = Fμ (fmap post m)
\item Generate verification conditions (VCs): \texttt{pre1 => wp} and hand off to an SMT solver
\end{itemize}
\subsection{Case Study: Cashmere}
\label{sec:orge02777a}
\begin{itemize}
\item \texttt{CashmereM}
\begin{itemize}
\item \texttt{NonDetT (ExceptT String (StateT Bal DivM))}
\end{itemize}
\item Bank operations
\begin{itemize}
\item Cash withdrawal, deposits, etc.
\end{itemize}
\item DSL (imperative-style)
\item \texttt{require}, \texttt{ensure}
\end{itemize}

Examples of Cashmere programs
\begin{itemize}
\item Withdraw an amount
\end{itemize}

\begin{verbatim}
bdef withdraw (amount : Nat) returns (u: Unit)
  ensures balance + amount = balanceOld do
  balance := balance - amount
  return

prove_correct withdraw by
loom_solve
\end{verbatim}

\begin{itemize}
\item Withdraw session (withdrawing multiple amounts)
\end{itemize}

\begin{verbatim}
open PartialCorrectness DemonicChoice in
bdef withdrawSession (amounts : List Nat) returns (u: Unit)
  ensures balance + amounts.sum = balanceOld do
  let mut tmp := amounts
  let balancePrev := balance
  while tmp.nonEmpty
  invariant balance + amounts.sum = balancePrev + tmp.sum
  do
    let amount := tmp.head!
    balance := balance - amount
    tmp := tmp.tail
  return

open PartialCorrectness DemonicChoice in
prove_correct withdrawSession by
loom_solve!
\end{verbatim}
\end{document}
